{
  "author": "artifacts@lnco.com",
  "blocks": [
    {
      "data": {
        "text": "When it comes to stocks and shares, I’ve never been a massive fan of (or very good at) predicting what the market will do over a period of 12 months or so. If it goes up, great, if it doesn’t- I’ll buy more and sit on it."
      },
      "id": "pLtMzKeQCX",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "With housing however, it isn’t quite that straight forward."
      },
      "id": "uQqP2Wi5ME",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "For most people, their house will be their largest single investment, so timing the purchase of it to allow for a better purchase price and favorable interest rates is very important."
      },
      "id": "Bn3bk9RegA",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "With that said, what could happen over the next 12 months or so?"
      },
      "id": "Xy0t26pMd3",
      "type": "paragraph"
    },
    {
      "data": {
        "caption": "",
        "file": {
          "url": "https://miro.medium.com/v2/resize:fit:700/1*wLmAsoakWo773orgmXhlQw.jpeg"
        },
        "stretched": false,
        "withBackground": false,
        "withBorder": false
      },
      "id": "lZ5URJedyR",
      "type": "image"
    },
    {
      "data": {
        "text": "Photo by&nbsp;<a href=\"https://unsplash.com/it/@ralphkayden?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\">Ralph (Ravi) Kayden</a>&nbsp;on&nbsp;<a href=\"https://unsplash.com/images/things/house?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\">Unsplash</a>"
      },
      "id": "ixkXK47neE",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Well, the simple answer to that question is; Nobody knows."
      },
      "id": "nT_cFnusu7",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Some analysts are predicting Armageddon, while others think that the bump will be about as noticeable as driving over an ant in a Rolls-Royce Phantom."
      },
      "id": "k-Rt8dliql",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "So what will it be? Well, I think somewhere in the middle, and for once, I have some actual statistics to back up my theory."
      },
      "id": "8Tg1OmEgRf",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "These numbers are UK based, but I would be very interested to do a comparison between us and the other side of the pond if anyone has some numbers."
      },
      "id": "BtGtKptVhi",
      "type": "paragraph"
    },
    {
      "data": {
        "caption": "",
        "file": {
          "url": "https://miro.medium.com/v2/resize:fit:700/1*-RD2YOjGqSKq-LJhq8N9Dw.jpeg"
        },
        "stretched": false,
        "withBackground": false,
        "withBorder": false
      },
      "id": "HFOwipGfUH",
      "type": "image"
    },
    {
      "data": {
        "text": "Photo by&nbsp;<a href=\"https://unsplash.com/@jrdcphoto?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\">Jon Cellier</a>&nbsp;on&nbsp;<a href=\"https://unsplash.com/photos/7JoXNRbx6Qg?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\">Unsplash</a>"
      },
      "id": "julHRb-mna",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "The average price of a home in the UK at the end of last year was £296,000- which is up £69,000 since the onset of the pandemic. That’s a staggering increase in 2 years, especially considering that most people have had the equivalent of a pay cut in that time."
      },
      "id": "cMOLP_fxvZ",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Not only that- but the percentage of mortgages that are fixed rate is 85%, which means that 85% of households will likely see their monthly payment increase when their fixed rate deal ends, and those rates have gone from an average of 2.34% in December 2021 to a peak of 6.65% at the tail end of last year. Sure, they’ve calmed down a bit, but most people will be paying twice the interest rate that they were just 2 years ago."
      },
      "id": "YTTI7TT8Zm",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "So how much are people borrowing?"
      },
      "id": "Q71eRb4f-m",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Well, the average first time deposit was £53,935- so the simple answer to that question is- a quarter of a million pounds. At 2.34%, that’s a monthly payment of £1,110.16 for a 25 year mortgage- which is more than manageable for a working couple. However, at 5%, it’s close to £1,500 a month, and at 12% it would be £2,656 a month. That’s a staggering increase in monthly payments over a 5 year period of time."
      },
      "id": "yi74U7naum",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Couple that to the 5% deposit scheme that was brought back in, suddenly people are finding that they’ve borrowed too much money and can’t afford their mortgages, or won’t be able to when their short-term fixed rate deals come to an end."
      },
      "id": "q8o1-O8yiA",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Now I’m not trying to sound all Michael Burry, but the average discount to asking price in the last 6 months has been 4%, the average house has stayed on the market for 18 weeks (which is above average), and the proportion of sellers who have cut their asking price is an incredible 25%."
      },
      "id": "UTtxDNkxOf",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Therefore, anyone who put down 10% or less last year is likely in negative equity now, and the mortgage rates haven’t even gone up yet."
      },
      "id": "3CbfKYNKaX",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "That would have been unheard of even 12 months ago, let alone at the start of the pandemic."
      },
      "id": "zqTEeSBb6z",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Doesn’t look great, does it?"
      },
      "id": "atj6OQ3n6J",
      "type": "paragraph"
    },
    {
      "data": {
        "caption": "",
        "file": {
          "url": "https://miro.medium.com/v2/resize:fit:700/1*YJC4zQTiDrZ4XLFERbNhEA.jpeg"
        },
        "stretched": false,
        "withBackground": false,
        "withBorder": false
      },
      "id": "gKMa4T1AZP",
      "type": "image"
    },
    {
      "data": {
        "text": "Photo by&nbsp;<a href=\"https://unsplash.com/@andreeeseba?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\">Andrea Sebastiani</a>&nbsp;on&nbsp;<a href=\"https://unsplash.com/photos/hFUdBvZde-0?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\">Unsplash</a>"
      },
      "id": "QZg8p6YhrF",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "A combination of small deposits, people saving during the pandemic and low interest rates have led many more people onto the property ladder- and as new homes weren’t being built, demand has forced the price of houses up- despite income remaining stagnant at best."
      },
      "id": "abadEtjh7s",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "This isn’t necessarily a bad thing, so long as it’s managed well. We all knew that low interest rates weren’t going to last forever, but that hasn’t stopped some people from borrowing too much. Add on the current cost of living crisis, and sadly some people will really struggle when their fixed rate deals come to an end late this year and early 2024."
      },
      "id": "iEgWAM-3e8",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Most analysts are predicting a fall of between 5% and 12% in house prices over the next 18 months, which isn’t 2008 all over again, but we seem to have forgotten some of the lessons that were learned just 15 years ago."
      },
      "id": "Y6WsitKwvS",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "Of course, if the Bank of England and other central banks can keep interest rates down, that will help, but that’s impossible without making the inflationary problem even worse, and all that would achieve is reducing mortgage payments and increasing rent and daily bills- fine for landlords, but not for the rest of us."
      },
      "id": "dmk7GeADI-",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "I’m not trying to be the main character in The Big Short 2.0 (although if I am, I think Jesse Eisenberg would do a great job of being me), but I really can’t see anything but down in the short term."
      },
      "id": "3FlFqEF-6N",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "That’s not necessarily a bad thing though- it’ll give people like me the chance to get on the ladder and investors will be able to pick up some bargains that’ll reap great rewards over time."
      },
      "id": "NmYQzo5UqN",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "The key is interest rates and inflation- how much will they rise and how quickly. The quicker the rates go up, the faster the property market will fall."
      },
      "id": "6lOkjLuMwG",
      "type": "paragraph"
    },
    {
      "data": {
        "text": "In the mean time, I’m off to the Morgan Stanley building to buy some credit default swaps."
      },
      "id": "RPu8dg-iNk",
      "type": "paragraph"
    }
  ],
  "highlight": {
    "content": "When it comes to stocks and shares, I’ve never been a massive fan of (or very good at) predicting what the market will do over a period o...",
    "header": "[duplicate] will the housing market collapse in 2023?",
    "id": "0a9c2ea6-9119-497d-8388-0d49e6af057e",
    "imgUrl": "https://miro.medium.com/v2/resize:fit:700/1*YJC4zQTiDrZ4XLFERbNhEA.jpeg",
    "tag": [
      {
        "name": "housing"
      },
      {
        "name": "real estates"
      },
      {
        "name": "pricing"
      }
    ],
    "username": "63f54bfb9b123cf287c8fbd9"
  },
  "id": "a3b9c8d7e6f5a4b3c2d1e0f",
  "time": 1682830751726,
  "version": "2.26.5"
}
